<template>
    <div>
        <div class="flex flex-col gap-6 md:pt-4">
            <p class="text-sm text-primary-50 text-justify">
                ساندویچ پانل‌ها سهم بزرگی در صنعت ساختمان سازی دارند. کاربرد این مصالح در سازه‌هایی که
                نیاز به مقاومت بالا و وزن کم باشد، بیشتر مشخص می‌شود. از آنجا که دیوارها بخش‌های مهمی در
                یک ساختمان هستند، نحوه درست ساخت آن‌ها می‌تواند عملکرد سازه را به شکل قابل توجهی بهبود
                دهد. کاربرد ساندویچ پانل از زمان تولید تا به امروز در سازه‌های متعددی بوده و مورد توجه
                سازندگان و مهندسان زیادی قرار گرفته است.

                شاید در نگاه اول ساختار ترکیبی پانل‌های دیواری طراحی ساده‌ای داشته باشد، ولی امکانات
                جدیدی را در اختیار معماران قرار داده است. بهبود عملکرد مقطع چه از نظر سازه‌ای و چه از
                لحاظ نفوذپذیری از مزیت‌های لایه‌ای بودن این پنل‌ها می‌باشد.
            </p>

            <button v-show="!isDescriptionVisible" class="text-secondary-500 text-xs max-w-max flex items-center gap-2" type="button" aria-label="مشاهده بیشتر" @click="showMore">
                مشاهده بیشتر
                <svg class="w-4	h-4">
                    <use href="#down"/>
                </svg>
            </button>
        </div>

        <div class="px-4 md:pr-0 md:pl-8">
            <div class="aspect-video">
                <video class="w-full h-full" controls>
                    <source src="/assets/video/home/video_mammut.mp4" type="video/mp4">
                </video>
            </div>
        </div>

        <div v-show="isDescriptionVisible" class="col-span-full">
            <div>
                <h2 class="text-xl font-bold">
                    ساختار ساندویچ پانل دیواری
                </h2>
                <p class="mt-4">
                    ساندویچ پنل‌ها مصالحی نوین در عصر امروز به شمار می‌روند که از زمان به‌کارگیری آن‌ها، صنعت ساخت و ساز
                    به طور ویژه‌ای تغییر یافت. تمامی انواع این مصالح از یک هسته مرکزی و دو متریال جانبی تشکیل شده‌اند که
                    این موارد در کنار هم یک کلیت واحد را ارائه می‌دهند. عنصر مرکزی در ساختار این مصالح از یک فوم عایق
                    بوده و طرفین آن از دو ورق مقاوم استفاده می‌شود که کارایی و بازدهی بالایی را ارائه می‌دهند. این
                    ساختار علاوه‌بر ساخت ساندویچ پانل در محصولات و صنایع دیگر نیز استفاده می‌گردد و دلیل ارجحیت آن‌ها به
                    مصالح بنایی نیز همین ساختار کامپوزیتی می‌باشد.
                </p>
            </div>
            <div class="grid grid-cols-1 gap-4 mt-4 md:grid-cols-2 lg:gap-16">
                <div>
                    <h2 class="text-xl font-bold">
                        انواع ساندویچ پانل دیواری
                    </h2>
                    <p class="mt-4">
                        این متریال پیش ساخته از نظر جنس مواد اولیه به‌کار رفته در ساختار آن‌ها به دو دسته کلی طبقه‌بندی
                        می‌گردند که هرکدام از آن‌ها باتوجه‌به ویژگی‌های منحصر به فرد خود در سازه‌های مختلف با کاربری
                        متفاوت به‌کار می‌روند و در ادامه به آن‌ها اشاره خواهیم کرد:
                        همانطور که پیش‌تر به آن اشاره شد، پانل‌های ساندویچی دارای سه لایه هستند که جنس متریال به کار
                        رفته در این ساختار با یکدیگر متفاوت است و براساس نوع کاربری سازه‌ها انتخاب خواهند شد. در هسته
                        مرکزی این مصالح مواد مختلفی به عنوان عایق استفاده می‌شود که از مهم‌ترین آن‌ها می‌توان به
                        پلی‌اورتان، پلی استایرن، پشم شیشه و… اشاره نمود. از پرکاربردترین مصالحی که از فوم‌های ذکر شده در
                        ساختار آن‌ها استفاده شده در کنار مزایای انواع فوم ساندویچ پانل در ادامه ذکر شده است:
                    </p>
                </div>
                <div>
                    <div class="relative w-full pt-[57%]">
                        <NuxtImg class="size-full absolute top-0 right-0" draggable="false"
                                 src="/assets/img/home/wall-panel-streucture.webp" alt="انواع ساندویچ پانل سقفی"/>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup>
defineOptions({
    name: "HomeProductOverviewRoofTab",
})

const isDescriptionVisible = ref(false);

const showMore = () => {
    isDescriptionVisible.value = true;
}
</script>