<template>
    <div class="col-span-full">
        <div>
            <h2 class="text-xl font-bold">
                ساختار ساندویچ پانل دیواری
            </h2>
            <p class="mt-4">
                ساندویچ پنل‌ها مصالحی نوین در عصر امروز به شمار می‌روند که از زمان به‌کارگیری آن‌ها،
                صنعت ساخت و ساز
                به طور ویژه‌ای تغییر یافت. تمامی انواع این مصالح از یک هسته مرکزی و دو متریال جانبی
                تشکیل شده‌اند که
                این موارد در کنار هم یک کلیت واحد را ارائه می‌دهند. عنصر مرکزی در ساختار این مصالح از یک
                فوم عایق
                بوده و طرفین آن از دو ورق مقاوم استفاده می‌شود که کارایی و بازدهی بالایی را ارائه
                می‌دهند. این
                ساختار علاوه‌بر ساخت ساندویچ پانل در محصولات و صنایع دیگر نیز استفاده می‌گردد و دلیل
                ارجحیت آن‌ها به
                مصالح بنایی نیز همین ساختار کامپوزیتی می‌باشد.
            </p>
        </div>
        <div class="grid grid-cols-1 gap-4 mt-4 md:grid-cols-2 lg:gap-16">
            <div>
                <h2 class="text-xl font-bold">
                    انواع ساندویچ پانل دیواری
                </h2>
                <p class="mt-4">
                    این متریال پیش ساخته از نظر جنس مواد اولیه به‌کار رفته در ساختار آن‌ها به دو دسته
                    کلی طبقه‌بندی
                    می‌گردند که هرکدام از آن‌ها باتوجه‌به ویژگی‌های منحصر به فرد خود در سازه‌های مختلف
                    با کاربری
                    متفاوت به‌کار می‌روند و در ادامه به آن‌ها اشاره خواهیم کرد:
                    همانطور که پیش‌تر به آن اشاره شد، پانل‌های ساندویچی دارای سه لایه هستند که جنس
                    متریال به کار
                    رفته در این ساختار با یکدیگر متفاوت است و براساس نوع کاربری سازه‌ها انتخاب خواهند
                    شد. در هسته
                    مرکزی این مصالح مواد مختلفی به عنوان عایق استفاده می‌شود که از مهم‌ترین آن‌ها
                    می‌توان به
                    پلی‌اورتان، پلی استایرن، پشم شیشه و… اشاره نمود. از پرکاربردترین مصالحی که از
                    فوم‌های ذکر شده در
                    ساختار آن‌ها استفاده شده در کنار مزایای انواع فوم ساندویچ پانل در ادامه ذکر شده است:
                </p>
            </div>
            <div>
                <div class="relative w-full pt-[57%]">
                    <NuxtImg class="size-full absolute top-0 right-0" draggable="false"
                             src="/assets/img/home/wall-panel-streucture.webp"
                             alt="انواع ساندویچ پانل سقفی"/>
                </div>
            </div>
        </div>
    </div>
</template>

<script setup>
defineOptions({
    name: "HomeProductOverviewRoofLong",
})
</script>